yang-8/run/template/system/blockMeshDict_3_1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    /*  0 */ (0 0 0)
    /*  1 */ (18 0 0)
    /*  2 */ (0 1 0)
    /*  3 */ (18 1 0)
    /*  4 */ (0 3 0)
    /*  5 */ (18 3 0)
    /*  6 */ (0 5 0)
    /*  7 */ (18 5 0)
    /*  8 */ (0 7 0)
    /*  9 */ (18 7 0)
    /* 10 */ (0 9 0)
    /* 11 */ (18 9 0)
    /* 12 */ (0 11 0)
    /* 13 */ (18 11 0)
    /* 14 */ (0 12 0)
    /* 15 */ (18 12 0)

    /* 16 */ (0 0 0.1)
    /* 17 */ (18 0 0.1)
    /* 18 */ (0 1 0.1)
    /* 19 */ (18 1 0.1)
    /* 20 */ (0 3 0.1)
    /* 21 */ (18 3 0.1)
    /* 22 */ (0 5 0.1)
    /* 23 */ (18 5 0.1)
    /* 24 */ (0 7 0.1)
    /* 25 */ (18 7 0.1)
    /* 26 */ (0 9 0.1)
    /* 27 */ (18 9 0.1)
    /* 28 */ (0 11 0.1)
    /* 29 */ (18 11 0.1)
    /* 30 */ (0 12 0.1)
    /* 31 */ (18 12 0.1)
);

blocks
(
    hex (0 1 3 2 16 17 19 18) (180 10 1) simpleGrading (1 1 1)
    hex (2 3 5 4 18 19 21 20) (180 20 1) simpleGrading (1 1 1)
    hex (4 5 7 6 20 21 23 22) (180 20 1) simpleGrading (1 1 1)
    hex (6 7 9 8 22 23 25 24) (180 20 1) simpleGrading (1 1 1)
    hex (8 9 11 10 24 25 27 26) (180 20 1) simpleGrading (1 1 1)
    hex (10 11 13 12 26 27 29 28) (180 20 1) simpleGrading (1 1 1)
    hex (12 13 15 14 28 29 31 30) (180 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (6 8 24 22)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 5 21 19)
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
            (0 2 18 16)
            (2 4 20 18)
            (4 6 22 20)
            (8 10 26 24)
            (10 12 28 26)
            (12 14 30 28)

            (1 3 19 17)
            (5 7 23 21)
            (7 9 25 23)
            (9 11 27 25)
            (11 13 29 27)
            (13 15 31 29)

            (0 1 17 16)
            (14 15 31 30)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 3 2)
            (2 3 5 4)
            (4 5 7 6)
            (6 7 9 8)
            (8 9 11 10)
            (10 11 13 12)
            (12 13 15 14)

            (16 17 19 18)
            (18 19 21 20)
            (20 21 23 22)
            (22 23 25 24)
            (24 25 27 26)
            (26 27 29 28)
            (28 29 31 30)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
